USE БД_Лаб2

--1)	Створити запити для вибірки даних з використанням (разом 12 запитів):
--a.	Найпростіших умов

SELECT * FROM Працівник_казначейства WHERE Посада = 'Директор'

SELECT * FROM Платіжне_доручення WHERE Дата = '2022-02-24'

--b.	Операторів порівняння

SELECT * FROM Регіональне_казначейство WHERE Кількість_бюджетних_установ > 100

--c.	Умов з використанням логічних операторів AND, OR та NOT.

SELECT * FROM Працівник_казначейства
WHERE Зарплата > 20000 AND Зарплата < 30000

SELECT * FROM Бюджетна_установа
WHERE Кількість_працівників > 200 OR Бюджет > 1000000000

SELECT * FROM Регіональне_казначейство
WHERE NOT Кількість_працівників > Кількість_бюджетних_установ

--d.	Умов з використанням комбінацій логічних операторів

SELECT * FROM Працівник_казначейства
WHERE Зарплата < 15000 AND (Казначейство = 'РГККВ01' OR Казначейство = 'РГККВОБЛ01')

--e.	З використанням виразів над стовпцями, як в якості новостворених стовпців, так і умовах
SELECT Казначейство, Посада, Зарплата*12 FROM Працівник_казначейства 

SELECT Казначейство, Посада, Зарплата FROM Працівник_казначейства
WHERE Зарплата/2 > 6700

--f.	Використання операторів:
--i.	Приналежності множині

SELECT Назва, Бюджет FROM Бюджетна_установа
WHERE Назва IN ('АДМІНІСТРАЦІЯ ПРЕЗИДЕНТА', 'ВЕРХОВНА РАДА', 'ПРОТИТУБЕРКУЛЬОЗНИЙ ДИСПАНСЕР')
 
--ii.	Приналежності діапазону

SELECT Імя, Прізвище, Зарплата FROM Працівник_казначейства WHERE Зарплата NOT BETWEEN 15000 AND 30000

--iii.	Відповідності шаблону
SELECT * FROM КЕКВ
WHERE Призначення LIKE 'Оплата%'

--iv.	Перевірка на невизначене значення

SELECT * FROM Платіжне_доручення WHERE Отримувач IS NULL

--2)	Створити запити з використанням підзапитів та з’єднань (разом 11 запитів) (в запитах повинні використовуватись 2 та більше таблиць):

--a.	Використання підзапитів в рядку вибірки полів (у секції select) та вибірки з таблиць (у секції from)

SELECT ID, Кількість_працівників, (
SELECT SUM(Зарплата) FROM Працівник_казначейства WHERE Казначейство = Регіональне_казначейство.ID)
FROM Регіональне_казначейство

--b.	Використання підзапитів в умовах з конструкціями EXISTS, IN

SELECT ID, Назва, Бюджет, Комерційний_банк FROM Бюджетна_установа AS ПБК_Бюджетні_установи
WHERE Бюджет > 50000000 AND EXISTS (SELECT ID FROM Комерційний_банк WHERE ID = 'ПБК' AND ID = ПБК_Бюджетні_установи.Комерційний_банк)

SELECT * FROM Працівник_казначейства
WHERE Казначейство IN (SELECT ID FROM Регіональне_казначейство WHERE Кількість_працівників < 25)

--c.	Декартовий добуток

SELECT Кошторис.ID AS 'Кошторис', КЕКВ.ID AS 'КЕКВи'
FROM Кошторис CROSS JOIN КЕКВ

--d.	З’єднання декількох таблиць за рівністю

SELECT * FROM Платіжне_доручення, Бюджетна_установа
WHERE Платіжне_доручення.Бюджетна_установа = Бюджетна_установа.ID
 
--e.	З’єднання декількох таблиць за рівністю та умовою відбору

SELECT * FROM Платіжне_доручення, Бюджетна_установа
WHERE Платіжне_доручення.Бюджетна_установа = Бюджетна_установа.ID AND Платіжне_доручення.Cума > Бюджетна_установа.Бюджет/20


--f.	Внутрішнього з’єднання

SELECT * FROM КЕКВ
INNER JOIN Платіжне_доручення ON Платіжне_доручення.Підстава =
КЕКВ.Призначення

--g.	Лівого зовнішнього з’єднання

SELECT * FROM Регіональне_казначейство
LEFT OUTER JOIN Бюджетна_установа ON Бюджетна_установа.Казначейство =
Регіональне_казначейство.ID

--h.	Правого зовнішнього з’єднання

SELECT * FROM Бюджетна_установа
RIGHT OUTER JOIN Комерційний_банк ON Бюджетна_установа.Комерційний_банк =
Комерційний_банк.ID

--i.	Об’єднання запитів

SELECT Казначейство, Назва FROM Бюджетна_установа
UNION
SELECT ID, Регіон FROM Регіональне_казначейство
WHERE ID = Регіональне_казначейство.ID
ORDER BY Назва
